tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Shell tools
brew "autojump"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "fpp"
brew "fzf"
brew "grep"
brew "pstree"
brew "tig"
brew "tmux"
brew "tree"
brew "zsh"

# Dev tools
brew "git"
brew "git-gui"
brew "jq"
brew "maven"
brew "openjdk@11"
cask "temurin"
brew "vault"

tap "wagoodman/dive"
brew "wagoodman/dive/dive"

tap "turbot/tap"
brew "turbot/tap/steampipe"

# General tools
brew "nmap"
brew "python@3.10"
brew "rclone"
brew "ruby"
brew "rust"
brew "sqlite"
brew "terminal-notifier"
brew "watch"
brew "wget"
brew "youtube-dl"

tap "saulpw/vd"
brew "saulpw/vd/visidata"

# GUI tools
cask "alfred"
cask "android-platform-tools"
cask "blackhole-2ch"
cask "bluesnooze"
cask "firefox"
cask "iterm2"
cask "itsycal"
cask "maestral"
cask "postman"
cask "rectangle"
cask "sourcetree"
cask "spotify"
cask "tailscale"
cask "visual-studio-code"
