tap "homebrew/bundle"

# Shell tools
brew "autojump"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "fpp"
brew "fzf"
brew "grep"
brew "pstree"
brew "tig"
brew "tmux"
brew "tree"
brew "zsh"

# Dev tools
brew "awscli"
brew "dive"
brew "git"
brew "git-gui"
brew "jq"
brew "kubernetes-cli"
brew "maven"
brew "openjdk@11"
brew "openjdk@17"
brew "python-setuptools"
cask "temurin"
brew "vault"

tap "turbot/tap"
brew "turbot/tap/steampipe"

# General tools
brew "ffmpeg"
brew "gron"
brew "nmap"
brew "python@3.10"
brew "rclone"
brew "ruby"
brew "rust"
brew "sqlite"
brew "terminal-notifier"
brew "watch"
brew "wget"
brew "youtube-dl"

tap "saulpw/vd"
brew "saulpw/vd/visidata"

# GUI tools
cask "alfred"
cask "arc"
cask "android-platform-tools"
cask "audacity"
cask "blackhole-2ch"
cask "bluesnooze"
cask "choosy"
cask "dbvisualizer"
cask "discord"
cask "easy-move-plus-resize"
cask "firefox"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "krisp"
cask "maestral"
cask "middleclick"
cask "notion"
cask "postman"
cask "rectangle"
cask "sourcetree"
cask "spotify"
cask "tailscale"
cask "visual-studio-code"
cask "vlc"

tap "espanso/espanso"
cask "espanso"
